# ⚪️ Planned changes ([link](https://castillo-a.app.spacelift.io/stack/terraform-aws001-prod/run/01HMHN1SG96EWX4PMKSDN492HT))
![add](https://img.shields.io/badge/add-2-brightgreen) ![change](https://img.shields.io/badge/change-0-yellow) ![destroy](https://img.shields.io/badge/destroy-0-red)
| Action | Resource | Changes |
| --- | --- | --- |
| Added | `aws_s3_bucket.aws001-bucket` | <details><summary>Value</summary>`{"bucket": "0add88ea", "force_destroy": false, "tags": null, "tags_all": {"IaC": "8877c0e7", "Project": "b6bc2df9", "Stakeholder": "94d99b88"}, "timeouts": null}`</details> |
| Added | `aws_s3_bucket_public_access_block.aws001-public-access` | <details><summary>Value</summary>`{"block_public_acls": true, "block_public_policy": true, "ignore_public_acls": true, "restrict_public_buckets": true}`</details> |

>_⚠️ Changes will be deployed after merging PR. New comment will show results after merge._

## Planning logs

```
[01HMH6YFW05BGXNQY4DJ7H305J] Planning changes with 0 custom hooks...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_s3_bucket.aws001-bucket will be created
  + resource "aws_s3_bucket" "aws001-bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "aws001-prod-bucket"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = {
          + "IaC"         = "terraform"
          + "Project"     = "001"
          + "Stakeholder" = "admin01"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket_public_access_block.aws001-public-access will be created
  + resource "aws_s3_bucket_public_access_block" "aws001-public-access" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

Plan: 2 to add, 0 to change, 0 to destroy.

[01HMH6YFW05BGXNQY4DJ7H305J] Changes are GO
[01HMH6YFW05BGXNQY4DJ7H305J] Uploading the list of managed resources...
[01HMH6YFW05BGXNQY4DJ7H305J] Please be aware that the run changes calculation includes output changes.
[01HMH6YFW05BGXNQY4DJ7H305J] Resource list upload is GO
[01HMH6YFW05BGXNQY4DJ7H305J] Generating JSON representation of the plan...
[01HMH6YFW05BGXNQY4DJ7H305J] JSON representation is GO
[01HMH6YFW05BGXNQY4DJ7H305J] Loading custom plan policy inputs...
[01HMH6YFW05BGXNQY4DJ7H305J] 0 custom plan policy inputs found
[01HMH6YFW05BGXNQY4DJ7H305J] No plan policies to evaluate
```
